//import 'package:admob_flutter/admob_flutter.dart';
import 'package:audio/utils/ads_helper.dart';
import 'package:audio/utils/my_theme.dart';
import 'package:facebook_audience_network/ad/ad_banner.dart';

//import 'package:facebook_audience_network/ad/ad_banner.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:flutter_markdown/flutter_markdown.dart';
import 'package:flutter_svg/flutter_svg.dart';

//import 'package:recipe/utils/ads_helper.dart';
//import 'package:recipe/utils/my_theme.dart';

class Privacy extends StatefulWidget {
  @override
  _PrivacyState createState() => _PrivacyState();
}

class _PrivacyState extends State<Privacy> {
  AdsHelper ads;
  String _markdownData = """
# **1. سياسة الخصوصية**

التاريخ الفعلي: هذه الخصوصية هي فعالة وآخر تجديد اعتبارا من 18 سبتمبر 2018

# **2. التزامنا خصوصيتك**

شكرا لك على استخدام التطبيق لدينا، وخصوصية مستخدمينا (بشكل جماعي "أنتم" أو "أنت") مهم جدا بالنسبة لنا. وثيقة سياسة الخصوصية توضح:

- كيف ولماذا نقوم بجمع بعض المعلومات عنك عن طريق التطبيق
- كيف نستخدم ونشارك هذه المعلومات
- سياستنا إتجاه الاطفال
- إذا كان لديك أي أسئلة بخصوص سياسة الخصوصية هذه أو لدينا جمع المعلومات واستخدام الممارسات، يرجى الاتصال بنا باستخدام المعلومات في قسم "اتصل بنا" أدناه.

# **3. المعلومات التي نجمعها**

  معلومات غير الشخصية: المعلومات غير الشخصية - نقوم بجمع معلومات غير شخصية عنك، جهازك واستخدامك للتطبيق، كما هو موضح في مزيد من التفاصيل أدناه، بما في ذلك     عن طريق استخدام "الكوكيز"، عدادات الشبكة، الكائنات المشتركة المحلية، أو أنواع أخرى تتبع التكنولوجيا.

**بالإضافة إلى ذلك ، قد يجمع التطبيق معلومات معينة تلقائيًا ، بما في ذلك ، على سبيل المثال لا الحصر ، نوع جهاز الجوّال الذي تستخدمه ، ومعرّف الجهاز الفريد لجهازك المحمول ، ونظام تشغيل الهاتف المحمول ، ونوع متصفحات الإنترنت المحمولة التي تستخدمها ، ومعلومات حول طريقة استخدامك للتطبيق****.**

لاحظ أن بعض الإعلانات المعروضة على التطبيق لدينا يتم تسليم من خلال ADMOB والفيسبوك شبكة الجمهور ثالثة شبكات الدعاية الحزبية. عند النقر على واحدة من هذه الإعلانات، ويجمع "انقر تدفق البيانات" المتعلقة بزيارتك لهذا الارتباط. انقر تدفق البيانات هو مجهول ويمكن أن تتضمن معلومات مثل عنوان IP الخاص بك، وصفحات الويب ينظر، التاريخ والوقت الذي كان ينظر تلك الصفحات والتفاعل مع المحتوى والإعلانات على تلك صفحات ويب. التقنيات المستخدمة لجمع ويشمل هذا بيانات النقر تيار الكوكيز ومنارات الويب.

قد اخترت عدم تلقي ملفات تعريف الارتباط من شبكات الإعلان طرف ثالث مثل محللون جوجل من خلال وصلة لملفات تعريف الارتباط صفحة التعطيل شبكة الإعلان المبادرات، التي يمكن العثور عليها هنا. يمكنك أيضا معرفة كيفية إجراء هذه التغييرات على المتصفح الخاص بك هنا.

# **c.**  **الطرف الثالث**

سمحنا لشركات خارجية لعرض الإعلانات و / أو جمع معلومات مجهولة معينة عند زيارة طلبنا. هذه الشركات قد تستخدم معلومات غير شخصية (على سبيل المثال، انقر فوق معلومات تيار، ونوع المتصفح والوقت والتاريخ، موضوع الإعلانات النقر أو تمريره فوق) خلال زياراتك لهذا الموقع ومواقع أخرى من أجل تقديم إعلانات حول البضائع والخدمات من المرجح أن أن تكون ذات فائدة أكبر للك. يرجى ملاحظة أن بيانات النقر تيار هو مجهول ويمكن أن تتضمن معلومات مثل عنوان IP الخاص بك، وصفحات الويب ينظر، التاريخ والوقت الذي كان ينظر تلك الصفحات والتفاعل مع المحتوى والإعلانات على تلك الصفحات على شبكة الإنترنت. التقنيات المستخدمة في جمع هذه نقرة وتشمل البيانات تيار الكوكيز ومنارات الويب.

قد اخترت عدم تلقي ملفات تعريف الارتباط من شبكات الإعلان طرف ثالث من خلال وصلة إلى صفحة تعطيل ملفات تعريف الارتباط من الشبكة الإعلان المبادرات، التي يمكن العثور عليها هنا. يمكنك أيضا معرفة كيفية إجراء هذه التغييرات على المتصفح الخاص بك هنا.


# **4. كيف نستخدم المعلومات التي يتم جمعها منك**

قد نستخدم المعلومات الشخصية والمعلومات غير الشخصية التي تم جمعها منك في أي واحد أو أكثر من الطرق التالية:

A. كيف نستخدم المعلومات الشخصية الخاصة بك - المعلومات الشخصية التي نجمعها ويمكن استخدام على النحو التالي:

- للتسجيل وخدمة حسابك.
- للسجلات الداخلية لدينا، وتتبع وأغراض تجارية؛
- من أجل الاتصال بك للرد على الأسئلة الخاصة بك أو طلبات أو لتوفير لكم مع الدعم الفني.
- لتزويدك بمعلومات عن تغييرات على تطبيق والتي قد تؤثر على الحساب الخاص بك، واستخدامك للتطبيق، و / أو المنتجات والخدمات المتاحة من خلال التطبيق.
- لتخصيص الإعلانات التي قد تكون واضحة لك على التطبيق

B. كيف نستخدم المعلومات غير الشخصية الخاصة بك - يتم استخدام المعلومات غير الشخصية التي تم جمعها منك لأغراض مختلفة، مثل:

- لتحسين منتجاتنا وخدماتنا.
- لتخصيص تجربة المستخدم للتطبيق.
- لإدارة التطبيقات.
- لتحليل الاتجاهات وتتبع حركة المستخدم وجمع المعلومات الإحصائية للاستخدام الكلي؛ و
- لتخصيص الإعلانات التي قد تكون واضحة لك على التطبيق

# **5. تقاسم المعلومات الخاصة بك**

سنحتفظ بالبيانات المقدمة بواسطة المستخدم طالما أنك تستخدم التطبيق ولفترة زمنية معقولة بعد ذلك. سنحتفظ بالمعلومات التي يتم جمعها تلقائيًا لمدة تصل إلى 24 شهرًا ، وبعد ذلك قد يتم تخزينها بشكل إجمالي. إذا كنت تريد منا حذف البيانات التي قدمتها من المستخدم عبر التطبيق ، فيرجى الاتصال بنا على الحساب وسنرد عليك في غضون فترة زمنية معقولة. يرجى ملاحظة أن بعض أو كل البيانات المقدمة من المستخدم قد تكون مطلوبة لكي يعمل التطبيق بشكل صحيح.

# **6. سياستنا تجاه الأطفال**

هذا التطبيق ليس مقصود للأطفال الذين تقل أعمارهم عن 13 ونحن لا نجمع أي معلومات شخصية من هؤلاء الأطفال. يجب على الأطفال تحت سن 13 لا تستخدم التطبيق أو الخدمات التي نقدمها عبر الإنترنت في أي وقت. في حال أننا علمنا ان المعلومات التي جمعناها عن غير قصد معلومات شخصية من الأطفال الذين تقل أعمارهم عن 13 عاما، سوف نستخدم الجهود المعقولة لمحوها من سجلاتنا.

# **7. تغييرات على هذه السياسة**

أ إذا قررنا إجراء تغييرات جوهرية على سياسة الخصوصية الخاصة بنا، ونحن سوف محاولة لإعلامك وغيرهم من مستخدمي التطبيق عن طريق إرسال إشعار إلى عنوان البريد الإلكتروني الذي قدم لنا و / أو عن طريق وضع إشعار على التطبيق لدينا. يجب عليك التحقق من دوري الإخطارات تطبيق لمثل هذه الملاحظات.
""";

  @override
  void initState() {
    super.initState();
    ads = new AdsHelper();
    ads.loadFbInter(AdsHelper.fbInterId_2);
  }

  @override
  Widget build(BuildContext context) {
    final controller = ScrollController();

    SystemChrome.setSystemUIOverlayStyle(SystemUiOverlayStyle(
        statusBarColor: Colors.transparent,
        statusBarIconBrightness: Brightness.dark));

    return WillPopScope(
      onWillPop: () async {
        ads.showInter(probablity: 30);
        return true;
      },
      child: Directionality(
        textDirection: TextDirection.rtl,
        child: Scaffold(
          backgroundColor: MyColors.darklight["light"],
          body: Stack(
            children: <Widget>[
              Positioned(
                right: -300.0,
                top: -200.0,
                child: Opacity(
                  child: SvgPicture.asset(
                    'assets/icons/privacy_policy.svg',
                    width: 800.0,
                  ),
                  opacity: 0.2,
                ),
              ),
              SafeArea(
                child: Column(
                  children: <Widget>[
                    Container(
                      width: MediaQuery
                          .of(context)
                          .size
                          .width,
                      child: ads.getFbBanner(
                          AdsHelper.fbBannerId_2, BannerSize.STANDARD),
                    ),
                    Align(
                      alignment: Alignment.topCenter,
                      child: Row(
                        children: <Widget>[
                          Expanded(
                            child: Text(
                              'سياسة الخصوصية',
                              style: Theme
                                  .of(context)
                                  .textTheme
                                  .headline6
                                  .apply(
                                  fontSizeFactor: 2,
                                  color: MyColors.vintageReport[1]),
                              textAlign: TextAlign.center,
                            ),
                          ),
                          Padding(
                            padding: const EdgeInsets.all(8.0),
                            child: SvgPicture.asset(
                              'assets/icons/privacy_policy.svg',
                              width: 30.0,
                            ),
                          ),
                        ],
                      ),
                    ),
                    Expanded(
                      child: Markdown(
                        styleSheet: MarkdownStyleSheet(
                          p: TextStyle(color: MyColors.vintageReport[0]),
                          strong: Theme
                              .of(context)
                              .textTheme
                              .headline6
                              .apply(color: MyColors.darklight["dark"]),
                        ),
                        styleSheetTheme: MarkdownStyleSheetBaseTheme.cupertino,
                        controller: controller,
                        selectable: true,
                        data: _markdownData,
                      ),
                    ),
                  ],
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
